# ProblemWithPeopleLoadWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EnergyAnalysisFailures..::..ProblemWithPeopleLoadWarn Property
BuiltInFailures..::..EnergyAnalysisFailures Class See Also
---
[Room]'s number of people or people load (sensible or latent) is too high. This may be caused by an incorrect density value and must be corrected before this space can be included in the load calculations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProblemWithPeopleLoadWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProblemWithPeopleLoadWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProblemWithPeopleLoadWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace